;//arcana038
*TOP
[eval exp="f.l_s038 = 1"][name_allreset]

;//井上コメント：このファイルは執筆しません

;//駅前背景あたりで『さて、帰るか』ぐらいのセリフを書くことは出来ますが、
;//arcana035～037から直接aracna900に繋いだ方が素直なため、ここは条件分岐だけのファイルにした方が無難です。
;//代わりにarcana039の方では繋ぎを入れておきます。

;//-----------------------------------------------------------------------------------------------------------------------
;//フラグ分岐
;//『arcana019』を経由している　→[038_A]
;//『arcana019』を経由していない→[038_B]

;条件分岐
[if exp="f.l_s019 == 1"][jump storage="arcana039.ks" target=*TOP]
[endif]
[ANTEN blk]
[jump storage="arcana900.ks" target=*TOP]

;	;//-----------------------------------------------------------------------------------------------------------------------
;	[038_A]
;	;//→arcana039へ
;	[jump storage="arcana039.ks" target=*TOP]
;
;	;//-----------------------------------------------------------------------------------------------------------------------
;	[038_A]
;	;//→arcana900へ
;	[jump storage="arcana900.ks" target=*TOP]

